app/api/tests/load/jmeter/over-limit.jmx
<?xml version="1.0" encoding="UTF-8"?>
<!-- over-limit.jmx: valida que 429 é resposta esperada acima do limite global, não 5xx. -->
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Vulnera over limit" enabled="true"><stringProp name="TestPlan.comments">Sem token: exercita /api/plans e aceita 200 ou 429.</stringProp><boolProp name="TestPlan.functional_mode">false</boolProp></TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Burst público" enabled="true"><stringProp name="ThreadGroup.num_threads">${__P(threads,10)}</stringProp><stringProp name="ThreadGroup.ramp_time">${__P(rampSeconds,1)}</stringProp><boolProp name="ThreadGroup.scheduler">true</boolProp><stringProp name="ThreadGroup.duration">${__P(durationSeconds,20)}</stringProp><elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true"><boolProp name="LoopController.continue_forever">true</boolProp><stringProp name="LoopController.loops">-1</stringProp></elementProp></ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET plans" enabled="true"><stringProp name="HTTPSampler.protocol">${__P(protocol,http)}</stringProp><stringProp name="HTTPSampler.domain">${__P(host,localhost)}</stringProp><stringProp name="HTTPSampler.port">${__P(port,3001)}</stringProp><stringProp name="HTTPSampler.path">/api/plans</stringProp><stringProp name="HTTPSampler.method">GET</stringProp><boolProp name="HTTPSampler.use_keepalive">true</boolProp></HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="200 ou 429 esperado" enabled="true"><collectionProp name="Assertion.test_strings"><stringProp name="100312">^(200|429)$</stringProp></collectionProp><stringProp name="Assertion.test_field">Assertion.response_code</stringProp><intProp name="Assertion.test_type">2</intProp></ResponseAssertion>
          <hashTree/>
          <!-- O HTTP Sampler nativo marca qualquer 4xx como erro; para este cenário
               429 é resultado esperado e não deve contaminar a métrica de erro da aplicação. -->
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Aceitar 429 esperado" enabled="true"><stringProp name="scriptLanguage">groovy</stringProp><stringProp name="script">if (prev.getResponseCode() == '200' || prev.getResponseCode() == '429') { prev.setSuccessful(true) }</stringProp></JSR223PostProcessor>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>